export const BIRTH_DAY_TEXT = `
לאבא היקר

לפני 60 שנים הגעת לאוויר העולם.
על זה אני בטוחה שסבתא והדודים יוכלו לספר ואכן יספרו, אבל אנחנו מכירים אותך "רק" 30, 28 ו-25 שנים בהתאמה.

אז מה נספר על אבא היקר שלנו אחרי כל כך הרבה שנים של היכרות?

נספר על אבא שתמיד דוחף בעליות ולא נותן לוותר, שמלמד שעם כוח רצון והתמדה אפשר לעשות הכל.

אבא שיודע הכל, שיש לו תשובה לכל שאלה.
אבא שיודע לזהות כל עקיצה או כאב כאילו הוא רופא, שיכול לקחת פלייר ולהציל ילד שנחנק מקליפה של פיצוחים או ילדה שטובעת בסחנה.

אבא שמבין בבניין, מסביר איך לפתוח סתימה, איך להחליף גוף תאורה ובא להציל כשיש הצפה בדירה.

אבא ספורטאי, שלפני כמה שנים טובות החליט לעשות שינוי ומאז הוא רץ, חותר, מתאמן, בים, בקאנטרי, בפארק, בבית, לתת איזה דיווש קטן שעה-שעתיים וללכת לישון.

אבא רציני שלימד אותנו שלכל פעולה יש תוצאה, שכדאי לחשוב לפני שעושים, ...

אבא שמתפתח עם השנים, שלומד לקבל ילדים שחושבים אחרת ממנו, אפילו כאלה חוצפנים שמתווכחים כי גם הם חושבים שהם יודעים הכל.
אבא שגאה בילדים שלו גם אם הוא מראה את זה בדרכים פולניות.


ומה נאחל לך אבא?
פשוט שתמשיך, כי יש לך כוחות אינסופיים לטרוף את החיים, להציב לעצמך יעדים ולהגיע אליהם. 
נאחל בריאות, כי זה מה שחשוב באמת.
שתמשיך להיות מאושר עם אמא הנפלאה, מסתובבים בכל הארץ, ביבשה ובים, צוחקים ונהנים כאילו אתם בני 20.
`;

export const getBirthDayTextList = () => {
  const cleanedText = BIRTH_DAY_TEXT.replace(/\r\n/g, "\n")
    .replace(/\"/g, "")
    .replace(/\./g, "")
    .replace(/,/g, "");

  const newText = cleanedText.split("\n").join(" ").split(" ").filter(Boolean);

  console.log({ newText });

  return newText;
};
